#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/shuuren/shuuren-alpha/runs/run-Et5AcvXTNLsddeik

Waiting for the plan to start...

Terraform v1.3.1
on linux_amd64
Initializing plugins and modules...
data.archive_file.signup: Reading...
data.archive_file.character: Reading...
data.archive_file.character: Read complete after 0s [id=e53c03ce69673bc085eb3cb7b38e6d9ade13e1af]
data.archive_file.signup: Read complete after 0s [id=6c21b48943481d4f6cb249fab0eaaad0281afe57]
aws_iam_policy.character_api_policy: Refreshing state... [id=arn:aws:iam::265390238424:policy/character_api_policy]
aws_iam_role.character_api_role: Refreshing state... [id=character_api_role]
aws_dynamodb_table.character: Refreshing state... [id=character]
aws_acm_certificate.shuuren_cert: Refreshing state... [id=arn:aws:acm:us-east-1:265390238424:certificate/adf4603e-1f50-4653-b239-ade0bcb8362d]
aws_iam_role.signup_event_role: Refreshing state... [id=signup_event_role]
aws_iam_policy.signup_event_policy: Refreshing state... [id=arn:aws:iam::265390238424:policy/signup_event_policy]
aws_api_gateway_rest_api.shuuren_api_gateway_rest_api: Refreshing state... [id=kvf6m5r20e]
aws_api_gateway_resource.shuuren_api_user: Refreshing state... [id=pbfffe]
aws_api_gateway_rest_api_policy.shuuren_api_policy: Refreshing state... [id=kvf6m5r20e]
aws_api_gateway_resource.shuuren_api_character: Refreshing state... [id=041x8i]
aws_api_gateway_method.shuuren_api_user_get: Refreshing state... [id=agm-kvf6m5r20e-pbfffe-GET]
aws_api_gateway_method.shuuren_api_character_put: Refreshing state... [id=agm-kvf6m5r20e-041x8i-PUT]
aws_api_gateway_integration.shuuren_api_user_get_integration: Refreshing state... [id=agi-kvf6m5r20e-pbfffe-GET]
aws_api_gateway_deployment.shuuren_api_deployment: Refreshing state... [id=habru0]
aws_acm_certificate_validation.shuuren_cert_validation: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
aws_api_gateway_stage.shuuren_api_stage: Refreshing state... [id=ags-kvf6m5r20e-api]
aws_api_gateway_domain_name.shuuren_api_gateway_custom_domain: Refreshing state... [id=api.shuuren.com]
aws_api_gateway_base_path_mapping.shuuren_api_mapping: Refreshing state... [id=api.shuuren.com/]
aws_iam_role_policy_attachment.signup_event_policy_attachment: Refreshing state... [id=signup_event_role-20221007045500101300000001]
aws_lambda_function.signup_post_confirmation: Refreshing state... [id=signup_post_confirmation]
aws_iam_role_policy_attachment.character_api_policy_attachment: Refreshing state... [id=character_api_role-20221008005716699000000001]
aws_lambda_function.update_character: Refreshing state... [id=update_character]
aws_cognito_user_pool.shuuren_user_pool: Refreshing state... [id=us-east-1_KFBySRRrW]
aws_lambda_permission.allow_api_gateway: Refreshing state... [id=AllowExecutionFromAPIGateway]
aws_api_gateway_integration.update_character_integration: Refreshing state... [id=agi-kvf6m5r20e-041x8i-PUT]
aws_cognito_user_pool_domain.shuuren_auth_domain: Refreshing state... [id=auth.shuuren.com]
aws_lambda_permission.allow_cognito_post_confirmation: Refreshing state... [id=AllowExecutionFromCognito]
aws_cognito_user_pool_client.shuuren_client: Refreshing state... [id=5t6dfe58g76h8vkmcfvb2o6keu]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_api_gateway_stage.shuuren_api_stage will be updated in-place
  ~ resource "aws_api_gateway_stage" "shuuren_api_stage" {
      ~ deployment_id         = "fh6rlf" -> "habru0"
        id                    = "ags-kvf6m5r20e-api"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

  # aws_lambda_function.update_character will be updated in-place
  ~ resource "aws_lambda_function" "update_character" {
        id                             = "update_character"
      ~ last_modified                  = "2022-10-08T01:31:29.752+0000" -> (known after apply)
      ~ source_code_hash               = "RI4qs1G+nDr9751rmBARaGkWPY+cpV3xrlXlLotPaO0=" -> "mYCZ24xmFJLgvmXMw9xU6Fe4COV8DIx3bYkYyMVWYGo="
        tags                           = {}
        # (19 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_permission.allow_api_gateway will be created
  + resource "aws_lambda_permission" "allow_api_gateway" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "update_character"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = "arn:aws:execute-api:us-east-1:265390238424:kvf6m5r20e/*/PUT/character"
      + statement_id        = "AllowExecutionFromAPIGateway"
      + statement_id_prefix = (known after apply)
    }

Plan: 1 to add, 2 to change, 0 to destroy.


```
</details>
*Pushed by: @rise-sudo, Action: `pull_request`*